/*******************************************************************************************
*                                আমাকে আমার মতো থাকতে দাও,                             * 
**                           আমি নিজেকে নিজের মতো গুছিয়ে নিয়েছি।                         **
***                           যেটা ছিলনা ছিলনা সেটা না পাওয়াই থাক,                         ***
****                                  সব পেলে নষ্ট জীবন।                                 **** 
*********************************************************************************************/
#include <bits/stdc++.h>
using namespace std;

int main()
{
    int tc,n,arr[29];
    scanf("%d",&tc);
    arr[0]=1;
    for(int i=1,j=2;i<29;i++,j*=2)
        arr[i]=arr[i-1]+j;
    while(tc--){
        scanf("%d",&n);
        for(int i=1;i<29;i++)
            if(n%arr[i]==0){
                printf("%d\n",n/arr[i]);
                break;
            }
    }
    return 0;
}
