/*******************************************************************************************
*                                আমাকে আমার মতো থাকতে দাও,                             * 
**                           আমি নিজেকে নিজের মতো গুছিয়ে নিয়েছি।                         **
***                           যেটা ছিলনা ছিলনা সেটা না পাওয়াই থাক,                         ***
****                                  সব পেলে নষ্ট জীবন।                                 **** 
*********************************************************************************************/

#include <bits/stdc++.h>
using namespace std;
#define lp(i,n) for(int i=0;i<n;i++)

int main()
{
    int tc,n;
    scanf("%d",&tc);
    while(tc--){
        scanf("%d",&n);
        if((n/2)%2==1){
            printf("NO\n");
        }
        else{
            printf("YES\n");
            lp(i,n/2)
                printf("%d ",2*(i+1));
            lp(i,n/2-1)
                printf("%d ",2*(i)+1);
            printf("%d\n",2*(n/2-1)+1+n/2);;
        }
    }
    return 0;
}
