/*******************************************************************************************
*                                আমাকে আমার মতো থাকতে দাও,                             * 
**                           আমি নিজেকে নিজের মতো গুছিয়ে নিয়েছি।                         **
***                           যেটা ছিলনা ছিলনা সেটা না পাওয়াই থাক,                         ***
****                                  সব পেলে নষ্ট জীবন।                                 **** 
*********************************************************************************************/
#include<bits/stdc++.h>
using namespace std;
#define endl '\n';

int main() {
    int t;
    cin >> t;
    while(t--) {
        int n;
        cin >> n;
        if(n < 10) {
            cout << ((n * (n + 1)) / 2) << endl;
        } else {
            int sum = 45; 
           
            for(int i = 10; i <= n; i++) {
                int num = i;
                while(num > 0) {
                    sum += num % 10; 
                    num /= 10; 
                }
            }
            cout << sum << endl;
        }
    }
    return 0;
}



