/*******************************************************************************************
*                                আমাকে আমার মতো থাকতে দাও,                             * 
**                           আমি নিজেকে নিজের মতো গুছিয়ে নিয়েছি।                         **
***                           যেটা ছিলনা ছিলনা সেটা না পাওয়াই থাক,                         ***
****                                  সব পেলে নষ্ট জীবন।                                 **** 
*********************************************************************************************/
#include <bits/stdc++.h>

using namespace std;

int main(){
    int n, m, sum =0;
    cin >> n >> m;
    int arr[n];
    for(int i =0; i<n; i++){
        cin >> arr[i];
    }
    sort(arr, arr+n);
    for(int i =0; i<m; i++){
        if(arr[i]>0) break;
        sum-=arr[i];
    }
        cout << sum <<endl;
}

