/*******************************************************************************************
*                                আমাকে আমার মতো থাকতে দাও,                             * 
**                           আমি নিজেকে নিজের মতো গুছিয়ে নিয়েছি।                         **
***                           যেটা ছিলনা ছিলনা সেটা না পাওয়াই থাক,                         ***
****                                  সব পেলে নষ্ট জীবন।                                 **** 
*********************************************************************************************/
#include <iostream>
using namespace std;
int main(){
    int t,s=0,d=0;
    cin>>t;
    int a[t];
    for(int i=0;i<t;i++){
        cin>>a[i];
    }
    int l=0,r=t-1;
    for(int i=0;i<t;i++){
        if(i%2==1){
            if(a[l]>=a[r]){
                d+=a[l++];
            }
            else{
                d+=a[r--];
            }
        }
        if(i%2==0){
            if(a[l]>=a[r]){
                s+=a[l++];
            }
            else{
                s+=a[r--];
            }
        }
    }
    cout<<s<<" "<<d;
    return 0;
}
